[{"model": "auth.user", "pk": 1, "fields": {"password": "pbkdf2_sha256$180000$jNkPAHPO9L9u$gvHu+GvtOYWug9jXCTbVWD+au3iGXS6I7AlczSvg96M=", "last_login": "2020-06-05T18:19:51.438Z", "is_superuser": true, "username": "djqazi", "first_name": "", "last_name": "", "email": "danqazi03@gmail.com", "is_staff": true, "is_active": true, "date_joined": "2020-05-28T04:18:53.999Z", "groups": [], "user_permissions": []}}, {"model": "viewer.case", "pk": 1, "fields": {"diagnosis": "Mullerian adenosarcoma", "history": "87 F with uterine polyps", "teach_points": "“Phyllodes-like” architecture with broad, leaf-like or club-like projections lined by cytologically bland epithelium. There is nice stromal condensation beneath the epithelial layer, best appreciated in the two-toned appearance of low and medium-power. At high power, the stromal cells are atypical and there are multiple mitotic figures. CD10 was blazing positive, supporting the diagnosis."}}, {"model": "viewer.case", "pk": 2, "fields": {"diagnosis": "Low grade endometrial stromal sarcoma", "history": "55 F with presumed uterine fibroids", "teach_points": "Classic “tongue-like” growth pattern at low power, with plugs of tumor infiltrating through the myometrium and in vascular spaces. Tumor cells are spindled-to-epithelioid with scant cytoplasm and are admixed within a background of delicate spiral arteriole-like thin-walled blood vessels."}}, {"model": "viewer.case", "pk": 3, "fields": {"diagnosis": "Squamous cell carcinoma arising in products of conception", "history": "31 F with retained products of conception", "teach_points": "While the morphology could be compatible with a gestational trophoblastic tumor, the presence of abortive squamous pearls in the final image should be a clue to the possibility of squamous cell carcinoma. As many of the antibodies will overlap between trophoblasts and squamous cell carcinoma, a high-risk HPV (ish) is critical to the diagnosis (and was positive in this case). This is a great example of being misled by the clinical history, which definitely suggests a gestation-related disease rather than a squamous cell carcinoma!"}}, {"model": "viewer.case", "pk": 4, "fields": {"diagnosis": "Adult granulosa cell tumor", "history": "55 F with ovarian mass", "teach_points": "Multinodular growth pattern of cellular nodules separated by vascular/fibrous septae. Pretty classic cytomorphology in the final image, with “coffee bean” nuclei (I think of them as sort of triangular or pointed at one end) and nuclear grooves. There is a hint of organization here, but no fully developed Call Exner Bodies. A reticulin stain showed loss of pericellular meshworks, helping to confirm the diagnosis."}}]